# -*- coding: utf-8 -*-

# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живут: ...

# TODO здесь ваш код
import room_1
import room_2

print ('В комнате 1 живут ', room_1.folks)
print ('В комнате 2 живут ', room_2.folks)



